[Killed] EqualityOperator
src/converter.js:9:15
     {
         result1 = (val/16).toFixed(2) + " pounds";
         result2 = (val/32000).toFixed(2) + " tons";
-    } else if(measurement === "pounds") {
+    } else if(measurement !== "pounds") {
         result1 = (val*16).toFixed(2) + " ounces";
         result2 = (val/2000).toFixed(2) + " tons";
killedBy: WeightConverter function should convert 5 pounds to ounces and tons
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ["80.00 ounces", "0.00 tons"]
Received: "wrong input"

[Survived] StringLiteral
src/converter.js:21:29
     return [result1, result2];
 }
 
-console.log(WeightConverter("ounces", 4));
+console.log(WeightConverter("", 4));
 module.exports = {
     WeightConverter

[Killed] ObjectLiteral
src/converter.js:22:18
 }
 
 console.log(WeightConverter("ounces", 4));
-module.exports = {
-    WeightConverter
-}
+module.exports = {}
killedBy: WeightConverter function should convert 4 ounces to pounds and tons
statusReason: TypeError: WeightConverter is not a function
