[Killed] ArrayDeclaration
src/mergeSort.js:10:10
       sortedArr.push(right.shift())
     }
   }
-  return [...sortedArr, ...left, ...right]
+  return []
 }
 function mergeSort(arr) {
killedBy: mergeSort function should correctly sort an array of numbers
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Array [
-   1,
-   3,

[Timeout] ArithmeticOperator
src/mergeSort.js:14:24
 }
 function mergeSort(arr) {
   if (arr.length <= 1) return arr
-  let mid = Math.floor(arr.length / 2)
+  let mid = Math.floor(arr.length * 2)
   let left = mergeSort(arr.slice(0, mid))
   let right = mergeSort(arr.slice(mid))

[Timeout] MethodExpression
src/mergeSort.js:15:24
 function mergeSort(arr) {
   if (arr.length <= 1) return arr
   let mid = Math.floor(arr.length / 2)
-  let left = mergeSort(arr.slice(0, mid))
+  let left = mergeSort(arr)
   let right = mergeSort(arr.slice(mid))
   return merge(left, right)

[Timeout] MethodExpression
src/mergeSort.js:16:25
   if (arr.length <= 1) return arr
   let mid = Math.floor(arr.length / 2)
   let left = mergeSort(arr.slice(0, mid))
-  let right = mergeSort(arr.slice(mid))
+  let right = mergeSort(arr)
   return merge(left, right)
 }
